//  use strict
// «use strict» — это директива ES5,
// которая заставляет весь наш код или код отдельной функции
// выполняться в строгом режиме

'use strict'

// 1 Нельзя присваивать значения или обращаться к необъявленным переменным/
// 2 Запрещено присваивать значения глобальный переменным, 
//   доступным только для чтения или записи.
// 3 Нельзя удалить «неудаляемое» свойство объекта.
// 4 Запрещено дублирование параметров.
// 5 Нельзя создавать функции с помощью функции eval.
// 6 Значением «this» по умолчанию является undefined.
// etc.